&НаСервере
Процедура ПолучитьСтруктуру(СтруктураЗначений)
	
	СтруктураЗначений.Очистить();	
	Для Каждого Запись Из Структура Цикл  		
		Если Запись.Ключ <> "" ИЛИ Запись.Значение <> "" Тогда 		
			СтруктураЗначений.Вставить(Запись.Ключ, Запись.Значение); 			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьЗначения(Команда)
	
	СтруктураЗначений = Новый Структура();
	ПолучитьСтруктуру(СтруктураЗначений);
	
	Ответ = СвойСтрШаблон(СтруктураЗначений, СтрокаЗакодированная);
	
	Сообщить(Ответ);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СвойСтрШаблон(Структура, Строка)
	
	
	
	
	
	
КонецФункции
