//Имеется некоторая сумма денег (бюджет). Необходимо написать функцию, которая бы пропорционально 
//дням распределяла бы этот бюджет по месяцам за ЛЮБОЙ период.        

//Пример: Период 22.03.2023 - 30.04.2023 (40 дней: 10 за март и 30 за апрель)
//Бюджет: 40 000
//Результат: соответствие с ключами 01.03.2023 и 01.04.2023 и значениями 10 000 и 30 000 соответственно.

&НаКлиенте
Процедура РаспределитьБюджетКоманда(Команда)
	
	РаспределениеБюджета.Очистить();
	
	// ------- проверка ввода данных 
	Если НачалоПериода = Дата('00010101') ИЛИ КонецПериода = Дата('00010101') ИЛИ Бюджет = 0 Тогда 
		Сообщить("Данных не хватает!"); 
		Возврат;
	КонецЕсли;
	
	Если НачалоПериода > КонецПериода Тогда 
		Сообщить("Период указан неправильно!"); 
		Возврат;
	КонецЕсли;
	// ------- проверка ввода данных
	
	ДолиПоМесяцам = РаспределитьБюджет(НачалоПериода, КонецПериода, Бюджет);
	
	ВывестиРезультат(ДолиПоМесяцам);
		
КонецПроцедуры  

&НаКлиенте
Процедура ВывестиРезультат(ДолиПоМесяцам)
	
	Для Каждого Доля Из ДолиПоМесяцам Цикл
		СтрокаТЧ = РаспределениеБюджета.Добавить();
		СтрокаТЧ.Ключ = Доля.Ключ;
		СтрокаТЧ.Значение = Доля.Значение;	
	КонецЦикла
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РаспределитьБюджет(НачалоПериода, КонецПериода, Бюджет)
	 
	ДолиПоМесяцам = Новый Соответствие();
	
	
	
	
	Возврат ДолиПоМесяцам;
	
КонецФункции


















